# -*- coding: utf-8 -*-


import re

line = "项目投资；不含投资与资产管理，并不得从事金融业务。一般项目：项目投资，投资管理，实业投资。（未经金融监管部门批准，不得从事吸收存款、融资担保、代客理财、向社会公众集（融）资等金融业务）（除许可业务外，可自主依法经营法律法规非禁止或限制的项目.未经批准不得从事P2P网贷、股权众筹、互联网保险、资管及跨界从事金融、第三方支付、虚拟货币交易、ICO、非法外汇等互联网金融业务）接受金融机构委托承接金融信息技术、业务流程、知识流程外包业务。投资管理金融机具；资产管理金融器材；销售电子产品；涉及货物进出口除外；技术推广服务；非证券业务的投资管理、咨询；股权投资管理；（不得从事下列业务：1、发放贷款；2、公开交易证券类投资或金融衍生品交易；3、以公开方式募集资金；4、对除被投资企业以外的企业提供担保；）；软件开发；计算机系统服务；数据处理（数据处理中的银行卡中心、PUE值在1.5以上的云计算数据中心除外）；房地产开发；物业管理；经营电信业务；互联网信息服务。（“1、未经有关部门批准，不得以公开方式募集资金；2、不得公开开展证券类产品和金融衍生品交易活动；3、不得发放贷款；4、不得对所投资企业以外的其他企业提供担保；5、不得向投资者承诺投资本金不受损失或者承诺最低收益”；企业依法自主选择经营项目，开展经营活动；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本市产业政策禁止和限制类项目的经营活动。）"
results = []

xx1 = u"不含[\uff0c\\s\u4e00-\u9fff\u3001]+业务"

xx2 = u"[\uff08\uff09\uff0c\\s\u4e00-\u9fff\u3001]+业务）"

xx3 = u"不得[\uff0c\\s\u4e00-\u9fff\u3001]+业务"

xx4 = u"严禁涉及[\uff0c\\s\u4e00-\u9fff\u3001]+业务"

xx5 = u"以上除[\uff0c\\s\u4e00-\u9fff\u3001]+业务"

xx6 = u"涉及[\uff0c\\s\u4e00-\u9fff\u3001]+除外"

xx7 = u"[\uff0c\\s\u4e00-\u9fff\u3001]+不得经营"

xx8 = u"不可以从事[\uff0c\\s\u4e00-\u9fff\u3001]+业务"

xx9 = u"不包括[\uff0c\\s\u4e00-\u9fff\u3001]+业务"

xx10 = u"不含[\uff0c\\s\u4e00-\u9fff\u3001]+"

xx11 = u"不得从事[\uff0c\\s\u4e00-\u9fff\u3001]+"

xx12 = u"严禁涉及[\uff0c\\s\u4e00-\u9fff\u3001]+"

xx13 = u"以上除[\uff0c\\s\u4e00-\u9fff\u3001]+"

xx14 = u"不可以从事[\uff0c\\s\u4e00-\u9fff\u3001]+"

xx15 = u"不包括[0-9\\s\uff1b\uff0c\u3001\uff1a\u4e00-\u9fff]+"

xx16 = u"[\uff0c\\s\u4e00-\u9fff\u3001]+除外"

xx17 = u"除[\uff0c\u3001\u4e00-\u9fff]+"  # 除开头的含 ，、中文 删掉

xx18 = u"不得[0-9\\s\uff1b\uff0c\u3001\uff1a\u4e00-\u9fff]+"  # 不得；，、数字）

xx19 = u"非[\uff0c\u3001\u4e00-\u9fff]+"

xx20 = u"未经[A-Za-z0-9\\s\uff1b\uff0c\u3001\uff1a\u4e00-\u9fff]+"

xx21 = u"不包括[0-9\\s\uff1b\uff0c\u3001\uff1a\u4e00-\u9fff]+"  # 不得；，、数字）

xx22 = u"金融器材"

xx23 = u"金融机具" + "|" + "[\\s\u4e00-\u9fff\u3001]+外包[\\s\u4e00-\u9fff\u3001]+"

xx = "{0}|{1}|{2}|{3}|{4}|{5}|{6}|{7}|{8}|{9}|{10}|{11}|{12}|{13}|{14}|{15}|{16}|{17}|{18}|{19}|{20}|{21}|{22}".format(
    xx18, xx19, xx20, xx21,
    xx16, xx7, xx8, xx9, xx10,
    xx11, xx12, xx13, xx14,
    xx15, xx22, xx17, xx1, xx2,
    xx3, xx4, xx5, xx23, xx6)
# xx = xx3 + "|" + xx18
pattern = re.compile(xx)
results += pattern.findall(line)

results = list(set(results))
for i in results:
    print(i)

newLine = line
for result in results:
    newLine = newLine.replace(result, " ")

print(newLine)
